Revit 2024 API
IExternalDBApplication Methods
The IExternalDBApplication type exposes the following members.
Methods
Name | Description
OnShutdown
Implement this method to execute some tasks when Autodesk Revit shuts down.
OnStartup
Implement this method to execute some tasks when Autodesk Revit starts.
See Also
IExternalDBApplication Interface
Autodesk.Revit.DB Namespace